{"timestamp": "2025-03-31T02:32:27.607635+00:00", "task": "keyword", "input": "일본어(日本語)는 주로 일본 열도에서 사용되는 일본어족 언어로, 일본의 공용어다.일본어를 직접적으로 공용어로 정하는 법이 존재하지 않는다. 다만 모든 법률이 일본어로 쓰여 있으며 재판소에서는 재판소법에 따라 일본어를 사용하고, 정규 교육과정에서도 일본어가 '국어' 과목으로 교육되기에 일본 사회에서는 '일본어는 곧 국어(공용어)'라는 전제가 당연하게 깔려있다.일본어는 오직 일본 열도에서만 모어로서 쓰이고, 일본 열도에서 태어나 살고 있는 일본인 절대 다수는 일본어를 모어로 하기 때문에 사실상 일본 인구수가 곧 일본어 사용자 수와 일치한다. 일본어를 모어로 사용하는 인구는 약 1억 2천만 명으로, 이는 전 세계 언어 중 9위에 해당한다.일본 외에 다른 나라에서는 사실상 사용하지 않는데다,[10] 다른 언어들과의 유사성도 적기 때문에 링구아 프랑카로서의 지위는 높지 않으나, 일본의 강한 경제력과 소프트 파워로 인한 학습 수요가 존재한다. 일본 국외의 일본어 학습자는 2018년 기준 380만 명 가량 존재하며 동아시아와 동남아시아가 일본어 학습 인구의 80%를 차지한다. 20세기 초반에는 일본 제국주의의 팽창에 따라 대만 · 한반도 · 만주 · 남태평양 등지에도 일본어가 국어로서 보급되었으나, 그 지배 기간이 긴 편이 아니었고 일본 제국이 제2차 세계 대전에서 패전해 해당 지역을 모두 상실한 탓에 현재는 이 지역들에서 모어 사용자가 거의 존재하지 않는다.특허협력조약에 따른 국제 공개어 10개 언어 가운데 한 언어다.", "output": "1. 일본어 : 점수 1\n2. 언어 : 점수 0.95\n3. 일본 군도 : 점수 0.85\n4. 공식 언어 : 점수 0.75\n5. 법원 법 : 점수 0.65\n\n다음 키워드의 점수는 0.6에서 0.7 사이입니다.\n6. 한국어 (점수 0.65)\n7. 일본인 인구 (점수 0.65)\n8. 세계 언어 (점수 0.6)\n9. 경제력으로 인한 학습 (0.6 점)\n10. 20 세기 초 (0.6 점)\n\n나머지 키워드는 대만, 한반도, 만주, 남태평양, 2018 년, 제 2 차 세계 대전의 패배, 링구아 프랑카, 정기 커리큘럼 등 0.6 미만입니다."}
{"timestamp": "2025-03-31T02:33:59.204609+00:00", "task": "keyword", "input": "세키네 히데유키 가천대 교수는 일본인의 기원이 한반도에 있다는 사실을 부정하고 왜곡하는 기조가 일본 학계에 있다고 주장하며, 일본인의 기원의 다양한 갈래를 주장하는 학자들도 도래인의 위상을 과소평가하거나 한반도 문화가 일본 열도에 전파된 것 정도로만 보려는 경향이 있다고 했다. 심지어 몇몇 일본 학자는 도래인이 한반도를 거치지 않고 시베리아, 만주, 중국 대륙 남부에서 바로 건너왔다고 보기도 한다는데, 어떻게든 한국인과의 직접적인 관계를 피하고자 만들어낸 정치적 의도가 담긴 주장이라고 보았다. 그는 현 일본 학계가 한일 간 명백한 문화적 연속성이 있음은 알고 있으면서도 혈연 관계는 인정하면 안 된다는 신념이 있는 것 같다고 말했다.[2]또한 세키네 교수는 일본 제국 시절 유리할 때는 일선동조(日鮮同祖)론을 내세우고, \"일본인은 조선을 조상의 나라로 생각했고, 일본은 (조선의) 식민지였다.\"라고 주장했던 학자(도쿄제국대 인류학 주임교수 도리이 류조, 1919년)도 있었던 일본 학계가 패전 후 제국주의와 군국주의의 빈자리를 채우기 위해 '특별한 민족론'을 내세우려 한반도와의 관계를 억지로 부정하고 있다고 비판했다.[3]일본에는 한반도에서 건너간 도래인 계통의 야요이인이 주류가 되어 형성된 현대 일본인(야마토 민족) 외에 일본 열도 선주민 조몬인의 직계 후손인 아이누족[4]이 있다는 점에 유의할 필요가 있다. 일본 정부에서는 그들을 일본인으로 인정하는 방침을 발표하였다. 또한 비교적 최근에 일본에 흡수되었거나 정착한 류큐인(오키나와 사람들), 재일 조선인(근현대 이후의 한반도 출신)들도 일본에 살고 있다.일본 열도를 시대 별로 살펴보면, 선사시대에 조몬인이 일본 열도에 정착하였으나(조몬 문화)[5], 기원전부터 한반도에서 이주한 도래인 계통의 야요이인이 조몬인들과 이합집산을 거치며 현재의 일본인(야요이 문화와 그 이후)이 되었다는 학설이 정설이다. 일본 내에서도 고고학적인 연구와 인류유전학적인 연구 결과가 이를 뒷받침한다. 또한 일본의 전신인 야마토(도래인 계통)가 백제와의 교류를 통해 한반도의 선진문물을 발빠르게 도입해서 일본 내에 존재했던 수많은 연맹-부족국가들을 복속시켰고, 추가적으로 도래인들을 대거 유입시키면서 인구를 증가시켰다는 역사적 기록도 엄연히 존재한다.본토 일본인들의 유전자 검사 결과, 한국인과 유전적으로 가장 가까운 민족으로 밝혀졌다.(2012년 11월 도쿄대 연구발표)주의해야 할 점이 있는데, 종종 일본인에 관한 생물학적인 연구를 할 때, 일본 내에 존재하는 오키나와인, 아이누인, 본토 일본인(야마토 민족)을 각각 비슷한 숫자로 표본을 수집하여 연구 결과를 낼 때도 있다. 이렇게 되면 1억 2천만 명이 넘는 일본 인구 중 오키나와인과 아이누인은 소수임에도 불구하고 그들의 유전 형질 비중(조몬인 계통)이 심하게 과대평가된다. 학계에서 이런 식으로 표본을 편향되게 수집하여 의도적으로 원하는 결과를 유도하는 행태가 아예 없는 게 아니므로 주의해야 한다. 의도한 부분은 아니었겠지만 암내 유전자 비율을 조사할 때도 유사한 경우가 있었다.", "output": "1. 일본어 : 점수 0.8\n2. 한반도 : 0.75 점수\n3. Jomon : 0.7 점\n4. 야마토 : 점수 0.65\n5. Yayoi 문화 : 점수 0.6\n\n이 점수는 텍스트에서 각 키워드의 빈도와 중요성을 나타냅니다.키워드 \"일본어\"는 토론의 주요 주제이기 때문에 점수가 가장 높으며, \"한반도\"는 일본 기원 주제와 관련이 있기 때문에 밀접하게 따릅니다.키워드 \"Jomon\", \"Yamato\"및 \"Yayoi Culture\"는 일본의 역사적 발전과 관련하여 중요합니다."}
